[
  {
    "clause_id": "NDA-DEF-001",
    "clause_type": "Definition",
    "category": "Definitions",
    "title": "Confidential Information - General Definition",
    "legal_intent": "Establish scope of protected information under the agreement",
    "is_mandatory": true,
    "clause_text": "\"Confidential Information\" means any and all information, whether written, oral, electronic, or visual, disclosed by one party (the \"Disclosing Party\") to the other party (the \"Receiving Party\") that is designated as confidential or that reasonably should be understood to be confidential given the nature of the information and the circumstances of disclosure.",
    "variants": [
      {
        "variant_id": "NDA-DEF-001-V1",
        "intent": "Comprehensive enumeration of information types",
        "style": "Detailed",
        "text": "\"Confidential Information\" shall include, but not be limited to, technical data, trade secrets, know-how, research, product plans, products, services, customers, customer lists, markets, software, developments, inventions, processes, formulas, technology, designs, drawings, engineering, hardware configuration information, marketing, finances or other business information."
      },
      {
        "variant_id": "NDA-DEF-001-V2",
        "intent": "Broad business-oriented definition",
        "style": "General",
        "text": "\"Confidential Information\" means all information of any kind, nature, or description concerning any matters affecting or relating to the Disclosing Party's business or its customers, including without limitation, any proprietary or confidential knowledge, data, or information."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["definition", "confidential information", "proprietary", "trade secrets"],
    "risk_level": "High",
    "negotiation_notes": "Ensure the definition is neither too broad nor too narrow. Consider excluding publicly available information.",
    "related_clauses": ["NDA-EXC-001", "NDA-OBL-001"]
  },
  {
    "clause_id": "NDA-DEF-002",
    "clause_type": "Definition",
    "category": "Definitions",
    "title": "Disclosing Party",
    "legal_intent": "Define party providing confidential information",
    "is_mandatory": true,
    "clause_text": "\"Disclosing Party\" means the party disclosing Confidential Information to the other party under this Agreement.",
    "variants": [],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["definition", "party", "disclosure"],
    "risk_level": "Low",
    "negotiation_notes": "Standard definition, typically non-contentious.",
    "related_clauses": ["NDA-DEF-001", "NDA-DEF-003"]
  },
  {
    "clause_id": "NDA-DEF-003",
    "clause_type": "Definition",
    "category": "Definitions",
    "title": "Receiving Party",
    "legal_intent": "Define party receiving confidential information",
    "is_mandatory": true,
    "clause_text": "\"Receiving Party\" means the party receiving Confidential Information from the other party under this Agreement.",
    "variants": [],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["definition", "party", "receipt"],
    "risk_level": "Low",
    "negotiation_notes": "Standard definition, typically non-contentious.",
    "related_clauses": ["NDA-DEF-001", "NDA-DEF-002"]
  },
  {
    "clause_id": "NDA-EXC-001",
    "clause_type": "Exception",
    "category": "Exclusions",
    "title": "Public Domain Exception",
    "legal_intent": "Exclude publicly available information from confidentiality obligations",
    "is_mandatory": true,
    "clause_text": "Confidential Information shall not include information that is or becomes generally available to the public other than as a result of a disclosure by the Receiving Party or its Representatives in violation of this Agreement.",
    "variants": [
      {
        "variant_id": "NDA-EXC-001-V1",
        "intent": "Specify timing of public availability",
        "style": "Precise",
        "text": "The obligations set forth in this Agreement shall not apply to information that is publicly known at the time of disclosure or becomes publicly known through no wrongful act of the Receiving Party."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["exclusions", "exceptions", "public domain"],
    "risk_level": "High",
    "negotiation_notes": "Critical to define what is NOT confidential. Ensure burden of proof is clearly allocated.",
    "related_clauses": ["NDA-DEF-001", "NDA-EXC-002"]
  },
  {
    "clause_id": "NDA-EXC-002",
    "clause_type": "Exception",
    "category": "Exclusions",
    "title": "Prior Possession Exception",
    "legal_intent": "Exclude information already possessed by receiving party",
    "is_mandatory": true,
    "clause_text": "Confidential Information shall not include information that was within the Receiving Party's possession prior to its being furnished by the Disclosing Party, provided that the source of such information was not known by the Receiving Party to be bound by a confidentiality obligation to the Disclosing Party.",
    "variants": [],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["exclusions", "prior knowledge", "possession"],
    "risk_level": "High",
    "negotiation_notes": "Receiving party bears burden of proof for prior possession.",
    "related_clauses": ["NDA-EXC-001", "NDA-EXC-003"]
  },
  {
    "clause_id": "NDA-EXC-003",
    "clause_type": "Exception",
    "category": "Exclusions",
    "title": "Third Party Disclosure Exception",
    "legal_intent": "Exclude information lawfully received from third parties",
    "is_mandatory": false,
    "clause_text": "Confidential Information shall not include information that becomes available to the Receiving Party on a non-confidential basis from a source other than the Disclosing Party, provided that such source is not known by the Receiving Party to be bound by a confidentiality obligation to the Disclosing Party.",
    "variants": [
      {
        "variant_id": "NDA-EXC-003-V1",
        "intent": "Emphasize no breach requirement",
        "style": "Explicit",
        "text": "The obligations shall not apply to information rightfully received by the Receiving Party from a third party without breach of any confidentiality obligation."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["exclusions", "third party", "lawful receipt"],
    "risk_level": "Medium",
    "negotiation_notes": "Clarify knowledge standard for third party obligations.",
    "related_clauses": ["NDA-EXC-002", "NDA-EXC-004"]
  },
  {
    "clause_id": "NDA-EXC-004",
    "clause_type": "Exception",
    "category": "Exclusions",
    "title": "Independent Development Exception",
    "legal_intent": "Exclude independently developed information",
    "is_mandatory": false,
    "clause_text": "Confidential Information shall not include information that is independently developed by the Receiving Party without reference to or use of the Confidential Information.",
    "variants": [
      {
        "variant_id": "NDA-EXC-004-V1",
        "intent": "Require proof of independence",
        "style": "Strict",
        "text": "Information shall be excluded only if the Receiving Party can demonstrate through written records that it was independently developed without access to or use of the Confidential Information."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["exclusions", "independent development", "clean room"],
    "risk_level": "Medium",
    "negotiation_notes": "Consider requiring contemporaneous documentation of independent development.",
    "related_clauses": ["NDA-EXC-003", "NDA-OBL-001"]
  },
  {
    "clause_id": "NDA-OBL-001",
    "clause_type": "Obligation",
    "category": "Obligations",
    "title": "Maintain Confidentiality",
    "legal_intent": "Require receiving party to protect confidential information",
    "is_mandatory": true,
    "clause_text": "The Receiving Party agrees to hold and maintain the Confidential Information in strict confidence and to take all reasonable precautions to protect such Confidential Information.",
    "variants": [
      {
        "variant_id": "NDA-OBL-001-V1",
        "intent": "Specify standard of care",
        "style": "Comparative",
        "text": "The Receiving Party shall protect the Confidential Information using the same degree of care it uses to protect its own confidential information of similar nature, but in no event less than reasonable care."
      },
      {
        "variant_id": "NDA-OBL-001-V2",
        "intent": "Absolute confidentiality requirement",
        "style": "Strict",
        "text": "The Receiving Party undertakes and agrees that it shall keep the Confidential Information secret and confidential."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["obligation", "confidentiality", "protection"],
    "risk_level": "Critical",
    "negotiation_notes": "Core obligation. Consider adding specific security measures if dealing with highly sensitive information.",
    "related_clauses": ["NDA-DEF-001", "NDA-OBL-002", "NDA-OBL-003"]
  },
  {
    "clause_id": "NDA-OBL-002",
    "clause_type": "Obligation",
    "category": "Obligations",
    "title": "Non-Disclosure to Third Parties",
    "legal_intent": "Prohibit disclosure of confidential information to unauthorized persons",
    "is_mandatory": true,
    "clause_text": "The Receiving Party agrees not to divulge any Confidential Information to any third person, other than to the Receiving Party's employees, officers, and advisors who have a need to know and who have been advised of and agreed to treat such information in accordance with the terms of this Agreement.",
    "variants": [
      {
        "variant_id": "NDA-OBL-002-V1",
        "intent": "Require written confidentiality agreements",
        "style": "Strict",
        "text": "The Receiving Party shall not disclose Confidential Information to any person without the prior written consent of the Disclosing Party, except to employees and advisors who are bound by confidentiality obligations at least as restrictive as those contained herein."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["obligation", "non-disclosure", "third parties"],
    "risk_level": "Critical",
    "negotiation_notes": "Define 'need to know' and whether advisors must sign separate agreements.",
    "related_clauses": ["NDA-OBL-001", "NDA-OBL-004"]
  },
  {
    "clause_id": "NDA-OBL-003",
    "clause_type": "Obligation",
    "category": "Obligations",
    "title": "Limit Use to Permitted Purpose",
    "legal_intent": "Restrict use of confidential information to specified purpose only",
    "is_mandatory": true,
    "clause_text": "The Receiving Party agrees that it will use the Confidential Information solely for the purpose of evaluating a potential business relationship between the parties and not for any other purpose.",
    "variants": [
      {
        "variant_id": "NDA-OBL-003-V1",
        "intent": "Require consent for other uses",
        "style": "Restrictive",
        "text": "The Receiving Party shall use the Confidential Information exclusively for the specified Purpose, and shall not use the Confidential Information for any other purpose without the prior written consent of the Disclosing Party."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["obligation", "use restriction", "purpose limitation"],
    "risk_level": "High",
    "negotiation_notes": "Clearly define the permitted purpose in the agreement. Vague purposes may lead to disputes.",
    "related_clauses": ["NDA-OBL-001", "NDA-TERM-001"]
  },
  {
    "clause_id": "NDA-OBL-004",
    "clause_type": "Obligation",
    "category": "Obligations",
    "title": "Return or Destroy Upon Termination",
    "legal_intent": "Require return or destruction of confidential materials upon request",
    "is_mandatory": true,
    "clause_text": "Upon the written request of the Disclosing Party or upon termination of this Agreement, the Receiving Party shall promptly return to the Disclosing Party all documents and materials containing Confidential Information and all copies thereof, or certify in writing that all such materials have been destroyed.",
    "variants": [
      {
        "variant_id": "NDA-OBL-004-V1",
        "intent": "Allow archival copy retention",
        "style": "Balanced",
        "text": "Upon termination or at the Disclosing Party's request, the Receiving Party shall return or destroy all Confidential Information, except that the Receiving Party may retain one copy solely for archival purposes and for ensuring compliance with this Agreement."
      },
      {
        "variant_id": "NDA-OBL-004-V2",
        "intent": "Disclosing party choice",
        "style": "Flexible",
        "text": "The Receiving Party shall, at the Disclosing Party's option, either return all Confidential Information or destroy all copies and certify such destruction in writing."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["obligation", "return", "destruction", "termination"],
    "risk_level": "Medium",
    "negotiation_notes": "Consider practical limitations (backup systems, email archives). Include exceptions for legal retention requirements.",
    "related_clauses": ["NDA-TERM-001", "NDA-OBL-001"]
  },
  {
    "clause_id": "NDA-DISC-001",
    "clause_type": "Conditional",
    "category": "Permitted Disclosures",
    "title": "Compelled Disclosure with Notice",
    "legal_intent": "Allow legally compelled disclosure while protecting disclosing party's rights",
    "is_mandatory": true,
    "clause_text": "If the Receiving Party becomes legally compelled to disclose any Confidential Information, the Receiving Party will provide the Disclosing Party with prompt written notice so that the Disclosing Party may seek a protective order or other appropriate remedy.",
    "variants": [
      {
        "variant_id": "NDA-DISC-001-V1",
        "intent": "Specify legal processes requiring disclosure",
        "style": "Detailed",
        "text": "In the event that the Receiving Party is requested or required by oral questions, interrogatories, requests for information or documents, subpoena, civil investigative demand, or similar process to disclose any Confidential Information, the Receiving Party shall provide the Disclosing Party with prompt notice of such request."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["compelled disclosure", "legal requirement", "subpoena", "protective order"],
    "risk_level": "Medium",
    "negotiation_notes": "Ensure notice requirement is reasonable (e.g., 'prompt' vs. specific timeframe). Consider who bears costs of seeking protective orders.",
    "related_clauses": ["NDA-OBL-001", "NDA-DISC-002"]
  },
  {
    "clause_id": "NDA-DISC-002",
    "clause_type": "Conditional",
    "category": "Permitted Disclosures",
    "title": "Minimum Necessary Disclosure",
    "legal_intent": "Limit compelled disclosure to minimum legally required",
    "is_mandatory": true,
    "clause_text": "In the event that a protective order is not obtained, the Receiving Party will furnish only that portion of the Confidential Information which is legally required and will exercise reasonable efforts to obtain reliable assurance that confidential treatment will be accorded the Confidential Information.",
    "variants": [
      {
        "variant_id": "NDA-DISC-002-V1",
        "intent": "Cooperation requirement",
        "style": "Collaborative",
        "text": "If compelled to disclose, the Receiving Party shall cooperate with the Disclosing Party in seeking a protective order and shall disclose only the minimum information necessary to comply with the legal requirement."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["compelled disclosure", "minimum disclosure", "cooperation"],
    "risk_level": "Medium",
    "negotiation_notes": "Clarify cooperation obligations and cost allocation for protective orders.",
    "related_clauses": ["NDA-DISC-001", "NDA-OBL-001"]
  },
  {
    "clause_id": "NDA-TERM-001",
    "clause_type": "Obligation",
    "category": "Term and Termination",
    "title": "Agreement Term",
    "legal_intent": "Establish duration of the confidentiality agreement",
    "is_mandatory": true,
    "clause_text": "This Agreement shall commence on the Effective Date and shall continue for a period of two (2) years, unless earlier terminated by either party upon thirty (30) days' written notice to the other party.",
    "variants": [
      {
        "variant_id": "NDA-TERM-001-V1",
        "intent": "Duration from last disclosure",
        "style": "Rolling",
        "text": "This Agreement shall remain in effect for a period of three (3) years from the date of last disclosure of Confidential Information by either party."
      },
      {
        "variant_id": "NDA-TERM-001-V2",
        "intent": "Auto-renewal provision",
        "style": "Extended",
        "text": "The term shall be five (5) years from the Effective Date, automatically renewing for successive one-year periods unless either party provides written notice of non-renewal at least sixty (60) days prior to the end of the then-current term."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["term", "duration", "termination", "notice period"],
    "risk_level": "Medium",
    "negotiation_notes": "Standard terms range from 2-5 years. Consider nature of information and industry practices. Distinguish between term of agreement vs. confidentiality obligations.",
    "related_clauses": ["NDA-TERM-002", "NDA-OBL-004"]
  },
  {
    "clause_id": "NDA-TERM-002",
    "clause_type": "Obligation",
    "category": "Term and Termination",
    "title": "Survival of Confidentiality Obligations",
    "legal_intent": "Ensure confidentiality obligations continue after agreement termination",
    "is_mandatory": true,
    "clause_text": "The obligations of the Receiving Party under this Agreement shall survive the termination of this Agreement and shall continue for a period of five (5) years from the date of disclosure of the Confidential Information.",
    "variants": [
      {
        "variant_id": "NDA-TERM-002-V1",
        "intent": "Perpetual protection for trade secrets",
        "style": "Tiered",
        "text": "The confidentiality obligations shall survive termination and continue indefinitely with respect to trade secrets and for a period of seven (7) years with respect to other Confidential Information."
      },
      {
        "variant_id": "NDA-TERM-002-V2",
        "intent": "Perpetual obligations",
        "style": "Maximum Protection",
        "text": "All obligations of confidentiality shall survive termination of this Agreement and continue in perpetuity."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["survival", "post-termination", "duration", "trade secrets"],
    "risk_level": "High",
    "negotiation_notes": "Trade secrets may warrant perpetual protection. Other confidential information typically 3-7 years. Align with statute of limitations.",
    "related_clauses": ["NDA-TERM-001", "NDA-DEF-001"]
  },
  {
    "clause_id": "NDA-REM-001",
    "clause_type": "Obligation",
    "category": "Remedies",
    "title": "Equitable Relief for Breach",
    "legal_intent": "Establish right to injunctive relief without proving damages",
    "is_mandatory": true,
    "clause_text": "The Receiving Party acknowledges that the Confidential Information is valuable and unique, and that disclosure of such information would cause irreparable harm to the Disclosing Party. The Disclosing Party shall be entitled to seek equitable relief, including injunction and specific performance, in addition to all other remedies available at law or in equity, without the necessity of proving actual damages or posting a bond.",
    "variants": [
      {
        "variant_id": "NDA-REM-001-V1",
        "intent": "Mutual acknowledgment of harm",
        "style": "Bilateral",
        "text": "Each party acknowledges and agrees that due to the unique nature of the Confidential Information, a breach may cause irreparable injury for which monetary damages would not be an adequate remedy, and that the non-breaching party shall be entitled to seek equitable relief without the requirement of posting a bond."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["remedies", "injunction", "equitable relief", "irreparable harm"],
    "risk_level": "High",
    "negotiation_notes": "Standard provision. May want to clarify that this does not waive right to monetary damages. Bond waiver may not be enforceable in all jurisdictions.",
    "related_clauses": ["NDA-OBL-001", "NDA-REM-002"]
  },
  {
    "clause_id": "NDA-REM-002",
    "clause_type": "Exception",
    "category": "Remedies",
    "title": "Limitation of Liability",
    "legal_intent": "Limit exposure to indirect and consequential damages",
    "is_mandatory": false,
    "clause_text": "In no event shall either party be liable to the other for any indirect, incidental, consequential, special, or punitive damages arising out of or relating to this Agreement, even if such party has been advised of the possibility of such damages.",
    "variants": [
      {
        "variant_id": "NDA-REM-002-V1",
        "intent": "Exclude lost profits specifically",
        "style": "Comprehensive",
        "text": "Neither party shall be liable for any indirect, special, incidental, punitive, or consequential damages, including lost profits, arising from or relating to this Agreement, whether based on warranty, contract, tort (including negligence), or any other legal theory."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["limitation of liability", "damages", "exclusions"],
    "risk_level": "Medium",
    "negotiation_notes": "Consider whether to exclude this limitation for willful breaches or gross negligence. May not be enforceable in all jurisdictions.",
    "related_clauses": ["NDA-REM-001", "NDA-MISC-001"]
  },
  {
    "clause_id": "NDA-OWN-001",
    "clause_type": "Obligation",
    "category": "Ownership and Rights",
    "title": "No License or IP Transfer",
    "legal_intent": "Clarify that no intellectual property rights are granted",
    "is_mandatory": true,
    "clause_text": "Nothing in this Agreement shall be construed as granting any rights to the Receiving Party, by license or otherwise, in or to any Confidential Information, or to any patent, copyright, trademark, or other intellectual property right of the Disclosing Party. All Confidential Information shall remain the sole property of the Disclosing Party.",
    "variants": [
      {
        "variant_id": "NDA-OWN-001-V1",
        "intent": "Explicit no implied license",
        "style": "Defensive",
        "text": "No license under any trademark, patent, copyright, or other intellectual property right is either granted or implied by the conveying of Confidential Information. All Confidential Information and intellectual property rights therein shall remain the exclusive property of the Disclosing Party."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["no license", "intellectual property", "ownership", "rights"],
    "risk_level": "Medium",
    "negotiation_notes": "Important to clarify no IP rights are transferred. Consider whether feedback/improvements on disclosed information create IP issues.",
    "related_clauses": ["NDA-DEF-001", "NDA-OWN-002"]
  },
  {
    "clause_id": "NDA-OWN-002",
    "clause_type": "Obligation",
    "category": "Ownership and Rights",
    "title": "No Obligation to Proceed",
    "legal_intent": "Preserve freedom to terminate negotiations without liability",
    "is_mandatory": false,
    "clause_text": "Nothing in this Agreement shall obligate either party to disclose any Confidential Information or to proceed with any proposed transaction or relationship. Either party may, in its sole discretion, terminate discussions and negotiations at any time without liability to the other party.",
    "variants": [
      {
        "variant_id": "NDA-OWN-002-V1",
        "intent": "Emphasize no continuing obligations",
        "style": "Clear",
        "text": "Neither party is under any obligation to disclose Confidential Information to the other party or to enter into any further agreement. Either party may cease further disclosures or discussions at any time without any liability whatsoever."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate",
    "tags": ["no obligation", "discretion", "termination", "freedom to contract"],
    "risk_level": "Low",
    "negotiation_notes": "Standard provision protecting both parties' freedom not to proceed. Particularly important in preliminary discussions.",
    "related_clauses": ["NDA-TERM-001", "NDA-MISC-001"]
  },
  {
    "clause_id": "NDA-SPEC-001",
    "clause_type": "Obligation",
    "category": "Special Provisions",
    "title": "Non-Solicitation of Employees",
    "legal_intent": "Prevent poaching of employees involved in confidential discussions",
    "is_mandatory": false,
    "clause_text": "During the term of this Agreement and for a period of one (1) year following its termination, neither party shall, directly or indirectly, solicit, recruit, or hire any employee of the other party who has been involved in the discussions or evaluation of Confidential Information, without the prior written consent of such other party.",
    "variants": [
      {
        "variant_id": "NDA-SPEC-001-V1",
        "intent": "Broader employee protection",
        "style": "Restrictive",
        "text": "Each party agrees that during the term and for two (2) years thereafter, it will not solicit for employment or hire any employee of the other party without prior written consent, except through general solicitations not specifically targeted at the other party's employees."
      }
    ],
    "jurisdiction": "US-MOST",
    "practice_area": "Corporate",
    "tags": ["non-solicitation", "employees", "restrictive covenant"],
    "risk_level": "High",
    "negotiation_notes": "May be controversial. Reasonableness depends on duration, scope, and jurisdiction. Some states limit enforceability (e.g., California). Consider carve-outs for general advertising.",
    "related_clauses": ["NDA-TERM-001", "NDA-MISC-002"]
  },
  {
    "clause_id": "NDA-SPEC-002",
    "clause_type": "Obligation",
    "category": "Special Provisions",
    "title": "Export Control Compliance",
    "legal_intent": "Ensure compliance with export control laws for technical data",
    "is_mandatory": false,
    "clause_text": "The Receiving Party acknowledges that certain Confidential Information may be subject to export control laws and regulations, including the Export Administration Regulations (EAR) and the International Traffic in Arms Regulations (ITAR). The Receiving Party agrees to comply with all applicable export control laws and shall not export, re-export, or transfer any Confidential Information except in compliance with such laws.",
    "variants": [
      {
        "variant_id": "NDA-SPEC-002-V1",
        "intent": "Require license verification",
        "style": "Compliance-Focused",
        "text": "Each party acknowledges that information exchanged may be subject to export controls under U.S. and foreign laws. Each party agrees to comply with all applicable export control laws and regulations, including obtaining any required licenses or authorizations prior to exporting, re-exporting, or transferring any controlled information or technology."
      }
    ],
    "jurisdiction": "US-ALL",
    "practice_area": "Corporate / Technology",
    "tags": ["export control", "ITAR", "EAR", "compliance"],
    "risk_level": "High",
    "negotiation_notes": "Critical for technology companies and defense contractors. Ensure compliance with EAR, ITAR, OFAC. May require license for certain disclosures.",
    "related_clauses": ["NDA-OBL-001", "NDA-MISC-002"]
  },
  {
    "clause_id": "NDA-SPEC-003",
    "clause_type": "Obligation",
    "category": "Special Provisions",
    "title": "GDPR and Data Privacy Compliance",
    "legal_intent": "Ensure compliance with data protection laws for personal data",
    "is_mandatory": false,
    "clause_text": "To the extent that any Confidential Information includes personal data (as defined under applicable data protection laws, including the General Data Protection Regulation), each party agrees to comply with all applicable data protection and privacy laws, including implementing appropriate technical and organizational measures to protect such personal data.",
    "variants": [
      {
        "variant_id": "NDA-SPEC-003-V1",
        "intent": "Require separate DPA",
        "style": "Comprehensive",
        "text": "If Confidential Information contains personal data subject to the GDPR, CCPA, or other data protection laws, the Receiving Party shall process such data only in accordance with the Disclosing Party's instructions and applicable law. The parties shall enter into a separate data processing agreement if required by applicable law."
      },
      {
        "variant_id": "NDA-SPEC-003-V2",
        "intent": "Breach notification requirement",
        "style": "Security-Focused",
        "text": "The Receiving Party shall implement appropriate security measures for personal data and shall notify the Disclosing Party of any data breach without undue delay, and in any event within 72 hours of becoming aware of the breach."
      }
    ],
    "jurisdiction": "EU-ALL",
    "practice_area": "Corporate / Privacy",
    "tags": ["GDPR", "data privacy", "personal data", "CCPA"],
    "risk_level": "Critical",
    "negotiation_notes": "Essential when dealing with EU personal data. May require separate DPA. Address data breach notification, data subject rights, and cross-border transfers.",
    "related_clauses": ["NDA-OBL-001", "NDA-DISC-001"]
  },
  {
    "clause_id": "NDA-MISC-001",
    "clause_type": "Miscellaneous",
    "category": "General Provisions",
    "title": "Governing Law and Jurisdiction",
    "legal_intent": "Establish applicable law and dispute resolution forum",
    "is_mandatory": true,
    "clause_text": "This Agreement shall be governed by and construed in accordance with [GOVERNING_LAW].",
    "variants": [
      {
        "variant_id": "NDA-MISC-001-V1",
        "intent": "US-California jurisdiction",
        "style": "State-Specific",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of the State of California, without regard to its conflicts of law principles. Each party irrevocably submits to the exclusive jurisdiction of the state and federal courts located in Santa Clara County, California, for any dispute arising out of or relating to this Agreement."
      },
      {
        "variant_id": "NDA-MISC-001-V2",
        "intent": "US-Delaware jurisdiction",
        "style": "State-Specific",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of the State of Delaware, without giving effect to any choice or conflict of law provision or rule. Each party irrevocably submits to the exclusive jurisdiction of the Court of Chancery of the State of Delaware (or, if the Court of Chancery does not have jurisdiction, the Superior Court of the State of Delaware, or if the Superior Court does not have jurisdiction, the United States District Court for the District of Delaware) for any dispute arising out of or relating to this Agreement."
      },
      {
        "variant_id": "NDA-MISC-001-V3",
        "intent": "US-New York jurisdiction",
        "style": "State-Specific",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of the State of New York, without regard to its conflicts of law principles. Each party irrevocably submits to the exclusive jurisdiction of the state and federal courts located in New York County, New York, for any dispute arising out of or relating to this Agreement."
      },
      {
        "variant_id": "NDA-MISC-001-V4",
        "intent": "UK-England jurisdiction",
        "style": "International",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of England and Wales. Each party irrevocably agrees that the courts of England and Wales shall have exclusive jurisdiction to settle any dispute or claim arising out of or in connection with this Agreement or its subject matter or formation (including non-contractual disputes or claims)."
      },
      {
        "variant_id": "NDA-MISC-001-V5",
        "intent": "Germany jurisdiction",
        "style": "International",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of the Federal Republic of Germany, excluding its conflicts of law rules and the United Nations Convention on Contracts for the International Sale of Goods (CISG). Each party irrevocably submits to the exclusive jurisdiction of the courts of Frankfurt am Main, Germany, for any dispute arising out of or relating to this Agreement."
      },
      {
        "variant_id": "NDA-MISC-001-V6",
        "intent": "Singapore jurisdiction",
        "style": "International",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of the Republic of Singapore. Each party irrevocably submits to the exclusive jurisdiction of the courts of Singapore for any dispute arising out of or relating to this Agreement."
      },
      {
        "variant_id": "NDA-MISC-001-V7",
        "intent": "Hong Kong jurisdiction",
        "style": "International",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of the Hong Kong Special Administrative Region. Each party irrevocably submits to the non-exclusive jurisdiction of the courts of Hong Kong for any dispute arising out of or relating to this Agreement."
      },
      {
        "variant_id": "NDA-MISC-001-V8",
        "intent": "ICC Arbitration",
        "style": "Arbitration",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of [GOVERNING_LAW_STATE]. Any dispute, controversy, or claim arising out of or relating to this Agreement, or the breach, termination, or invalidity thereof, shall be finally resolved by arbitration in accordance with the Rules of Arbitration of the International Chamber of Commerce (ICC). The arbitration shall be conducted by a sole arbitrator (or three arbitrators for disputes exceeding $1,000,000) in [ARBITRATION_CITY]. The language of the arbitration shall be English."
      },
      {
        "variant_id": "NDA-MISC-001-V9",
        "intent": "AAA Arbitration",
        "style": "Arbitration",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of [GOVERNING_LAW_STATE], without regard to its conflicts of law principles. Any dispute arising out of or relating to this Agreement shall be resolved by binding arbitration administered by the American Arbitration Association (AAA) in accordance with its Commercial Arbitration Rules. The arbitration shall be conducted in [ARBITRATION_CITY] before a single arbitrator. Judgment on the award rendered by the arbitrator may be entered in any court having jurisdiction thereof."
      },
      {
        "variant_id": "NDA-MISC-001-V10",
        "intent": "LCIA Arbitration",
        "style": "Arbitration",
        "text": "This Agreement shall be governed by and construed in accordance with the laws of England and Wales. Any dispute arising out of or in connection with this Agreement, including any question regarding its existence, validity, or termination, shall be referred to and finally resolved by arbitration under the Rules of the London Court of International Arbitration (LCIA). The seat of arbitration shall be London, United Kingdom. The number of arbitrators shall be one. The language of the arbitration shall be English."
      }
    ],
    "jurisdiction": "GLOBAL",
    "practice_area": "Corporate",
    "tags": ["governing law", "jurisdiction", "choice of law", "dispute resolution", "arbitration"],
    "risk_level": "High",
    "negotiation_notes": "Critical provision determining applicable law and forum for disputes. Consider party locations, neutral forums for international deals, and enforceability of arbitration clauses. Delaware popular for corporate disputes. Arbitration provides confidentiality and expertise but may limit appeals.",
    "related_clauses": ["NDA-DISC-001", "NDA-REM-001", "NDA-MISC-002"]
  }
]
